trade_exp/src/Catalogs/ТранспортныеСредстваСобственные/ТранспортныеСредстваСобственные.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="f419e575-4d98-47da-969d-a13ae4004f2f">
  <name>ТранспортныеСредстваСобственные</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="a9427e01-9df2-45f6-a96f-ad9d2a081588">
    <name>Механик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d872a441-cb0c-4ca7-a037-3300606999e0">
    <name>УчитыватьПоказанияСпидометра</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ef959d59-3610-4439-a26a-8f555f6e4103">
    <name>НачальноеПоказание</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="c4474bed-ee47-478d-a662-463b72a17e82">
    <name>СпидометрСчетчик</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="e1c07b6e-5ce0-49a0-93a3-2d6089c84793">
    <name>Модель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="d9697f0c-7683-4955-a57a-b52c3ae12976">
    <name>ДатаВыпуска</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="47af42cc-0ea3-416b-8616-c42b36ede659">
    <name>ГосНомер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="2419c349-b816-488c-a049-ec05fcf244b7">
    <name>СтатьяРасходов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="666913e4-80ec-41b0-a6ec-78b1e3a26395">
    <name>АналитикаРасходов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

trade_exp/src/Catalogs/ТранспортныеСредстваСобственные/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура МодельПриИзменении(Элемент)
	ОбновитьНаименованиеНаСервере();
	
КонецПроцедуры
&наСервере
Процедура ОбновитьНаименованиеНаСервере()
	если не ЗначениеЗаполнено(Объект.Наименование) тогда
		Объект.Наименование=СОКРЛП(Объект.Модель)+" ("+СОКРЛП(Объект.ГосНомер)+" )";
	конецесли;
КонецПроцедуры

&НаКлиенте
Процедура ГосНомерПриИзменении(Элемент)
	ОбновитьНаименованиеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	 ВидимостьЭлементовФормы();
КонецПроцедуры
&НаСервере
Процедура ВидимостьЭлементовФормы()
	Элементы.НачальноеПоказание.Видимость=Объект.УчитыватьПоказанияСпидометра;
КонецПроцедуры

&НаКлиенте
Процедура УчитыватьПоказанияСпидометраПриИзменении(Элемент)
	  ВидимостьЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура СтатьяРасходовПриИзменении(Элемент)
		ФинансыКлиент.СтатьяРасходовПриИзменении(Объект, Элементы);
	СтатьяРасходовПриИзмененииСервер();

КонецПроцедуры
&НаСервере
Процедура СтатьяРасходовПриИзмененииСервер()
	
	ДоходыИРасходыСервер.СтатьяРасходовПриИзменении(
		Объект,
		Объект.СтатьяРасходов,
		Объект.АналитикаРасходов
	);
	
КонецПроцедуры
